Creates a hanger on the fabrication part.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public static FabricationPart CreateHanger(
	Document document,
	FabricationServiceButton button,
	int condition,
	ElementId hostId,
	Connector hostConnector,
	double distance,
	bool attachToStructure
)
  Visual Basic
Public Shared Function CreateHanger ( _
	document As Document, _
	button As FabricationServiceButton, _
	condition As Integer, _
	hostId As ElementId, _
	hostConnector As Connector, _
	distance As Double, _
	attachToStructure As Boolean _
) As FabricationPart
  Visual C++
public:
static FabricationPart^ CreateHanger(
	Document^ document,
	FabricationServiceButton^ button,
	int condition,
	ElementId^ hostId,
	Connector^ hostConnector,
	double distance,
	bool attachToStructure
)
 Parameters
  document
 Type:  Autodesk.Revit.DB Document
 The document.
  button
 Type:  Autodesk.Revit.DB FabricationServiceButton
 The fabrication service button to use.
  condition
 Type:  System Int32
 The condition index. If the button has multiple conditions.
  hostId
 Type:  Autodesk.Revit.DB ElementId
 The host part id. The host should be one horizontal straight part.
  hostConnector
 Type:  Autodesk.Revit.DB Connector
 The connector of the host.
  distance
 Type:  System Double
 The distance from the input connector of the host part. Units are in feet (ft).
  attachToStructure
 Type:  System Boolean
 Attach to the nearest structural element. The structural element might be one of Floor/Roof/Stair/Stucture Framing.
 Return Value
 The newly-created fabrication hanger.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   Hangers may only be placed on straight horizontal fabrication segments. -or- Invalid fabrication service button. -or-
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
   Autodesk.Revit.Exceptions ArgumentOutOfRangeException   |   the index condition is not larger or equal to 0 and less than ConditionCount
   Autodesk.Revit.Exceptions InvalidOperationException   |   the distance is out of range. -or- cannot find suitable fabrication part for the host. -or- cannot place hanger on the host.
 See Also
  FabricationPart Class
  CreateHanger Overload
  Autodesk.Revit.DB Namespace